doc/latex/tud-beamerstyle/beamer-org-mode-demo.org
#+TITLE:     Beamer-Präsentationen mit dem CD der TU Dresden
#+AUTHOR:    Tobias Schlemmer
#+EMAIL:     Tobias.Schlemmer@tu-dresden.de
#+DATE:      @latex:7.\,5.~2012@
#+DESCRIPTION:
#+KEYWORDS:
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:f
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:
#+startup: beamer
#+startup: indent
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation,t]
#+BEAMER_FRAME_LEVEL: 3
#+LATEX_HEADER_EXTRA: \pdfmapfile{+tud}%
#+LATEX_HEADER_EXTRA: \pdfmapfile{+tudscr}%
#+LATEX_HEDAER_EXTRA: %
#+LATEX_HEDAER_EXTRA: %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
#+LATEX_HEDAER_EXTRA: %                                                                %
#+LATEX_HEDAER_EXTRA: % Vereinfachte Organisation von Präsentationen mit               %
#+LATEX_HEDAER_EXTRA: % Emacs und org-mode                                             %
#+LATEX_HEDAER_EXTRA: %                                                                %
#+LATEX_HEDAER_EXTRA: %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
#+LATEX_HEDAER_EXTRA: %                                                                %
#+LATEX_HEDAER_EXTRA: % Automatisch erstellt mit Hilfe von Emacs und org-mode          %
#+LATEX_HEDAER_EXTRA: % Die .org-Datei kann mit Emacs und installiertem or -Paket      %
#+LATEX_HEDAER_EXTRA: % bearbeitet und nach LaTeX exportiert werden.                   %
#+LATEX_HEDAER_EXTRA: % Der Export ist über die Tastenkombination C-C e l P möglich    %
#+LATEX_HEDAER_EXTRA: %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
#+LATEX_HEDAER_EXTRA: %
#+LATEX_HEADER_EXTRA: \usepackage{amsmath}
#+LATEX_HEADER_EXTRA: \usepackage{uniinput}
#+LATEX_HEADER_EXTRA: \usepackage{amsfonts}
#+LATEX_HEADER_EXTRA: \usepackage{tikz}
#+LATEX_HEADER_EXTRA: \usepackage[ngerman]{babel}
#+LATEX_HEADER_EXTRA: \usetikzlibrary{decorations.pathmorphing}
#+LATEX_HEADER_EXTRA: \useinnertheme{rounded}
#+LATEX_HEADER_EXTRA: \usetheme[section,navigation,pagenum,ddc]{tud}
#+LATEX_HEADER_EXTRA: %\usetheme{Boadilla}
#+LATEX_HEADER_EXTRA: %\usecolortheme{tud}
#+LATEX_HEADER_EXTRA: \institut{Institut f\"ur Algebra}%
#+LATEX_HEADER_EXTRA: \DeclareMathOperator\Orb{Orb}%
#+LATEX_HEADER_EXTRA: \title[TUD-CD mit \LaTeX\ gesetzt]{Beamer-Präsentationen mit dem CD der TU Dresden}
#+LATEX_HEADER_EXTRA: \AtBeginDocument{\date{22.\,6.~2016}}
#+LATEX_HEADER_EXTRA: \subtitle{TUD-CD mit \LaTeX\ gesetzt}
#+LATEX_HEADER_EXTRA: \setbeamerfont{description item}{series=\bfseries}
#+LATEX_HEADER_EXTRA: \setbeamertemplate{date/place in footline}[default][T. Schlemmer]
#+LATEX_HEADER_EXTRA: \setbeamertemplate{page number in footline}[frame][total]
#+LATEX_HEADER_EXTRA: \AtBeginSection[]{\begin{frame}<beamer>[allowframebreaks]\frametitle{Abschnitt}\footnotesize\tableofcontents[currentsection]\end{frame}}
#+LATEX_HEADER_EXTRA: \setlength{\tudbeamerfooterplacewidth}{0.3\linewidth}%
#+LATEX_HEADER_EXTRA: \setlength{\tudbeamerfooterpagenumwidth}{5em}%
#+LATEX_HEADER_EXTRA: \makeatletter
#+LATEX_HEADER_EXTRA: %\setlength{\tudbeamerfootertitlewidth}{\paperwidth-\beamer@leftmargin-\beamer@rightmargin
#+LATEX_HEADER_EXTRA: %   -\tudbeamerfooterplacewidth-\tudbeamerfooterpagenumwidth}%
#+LATEX_HEADER_EXTRA: \makeatother
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_envargs(Env Args) %4BEAMER_col(Col) %8BEAMER_extra(Extra)
#+PROPERTY: BEAMER_col_ALL 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1.0 :ETC
#+LANGUAGE: de
* Einführung
** Allgemeines
*** Geschichte
- Corporate Design der TU Dresden
- tudbeamer Klasse (mit vielen Nachteilen)
- tud-cd-Paket
- \alert{Konfigurierbarer Beamer-Stil}
*** CD-Vorgaben (Handbuch)
- \textcolor{HKS65K100}{Ränder relativ zu Papiergrüße}
- \textcolor{red}{Schriften in MS Punkt (inkompatible Maßeinheit)}
- \textcolor{red}{Logoposition fehlt}
*** Designkriterien
- Interpretation der Vorgaben
- Abweichend: HKS Farbschema und Univers
- Kombinierbar mit @@latex:\textbackslash useinnertheme\{rounded\}@@
- Farbschema mit anderem Layout kombinierbar (partiell implementiert)
- Alle Stile überschreibbar
** Benutzung
*** Beispieldokument                                              :B_example:
:PROPERTIES:
:BEAMER_env: example
:END:
\textbackslash usepackage[ngerman]{babel}\\
\textbackslash usetheme[section,navigation]{tud}\\
\textbackslash institut{Institut f\textbackslash ''ur Algebra}%\\
\textbackslash title[Beispiel]{Langer Titel mit Beispiel}\\
\textbackslash begin{document}\\
\textbackslash maketitle\\
\textbackslash begin{frame}{Eine Folie}\\
Inhalt\\
\textbackslash end{frame}\\
\textbackslash end{document}\\

* Einstellungen
** @@latex:\textbackslash usetheme\{tud\}@@
*** Paketoptionen (Schriften)
- noeulermath :: Benutze keine Euler-Mathematikschriften
- noDIN :: Titel ohne DIN bold
- serifmath :: Nutze Computer Modern für Mathematik
- heavyfont :: Nutze Univers 55 statt Univers 45
- beamerfont :: Keine Fontänderungen
*** Paketoptionen (Seitenstruktur)
- noheader :: Benutze Folien ohne Kopfzeile
- smallrightmargin :: Schmaler rechter Rand (verletzt CD-Richtlinie
- pagenum :: Seitenzahlen in der Fußzeile anzeigen
- section :: mit Abschnittstitel auf jeder Folie
- navbar :: mit Navigationshilfen
- noddc :: ohne DRESDEN"=concept-Logo
- ddc :: mit DRESDEN"=concept-Logo
- ddcfooter :: mit DRESDEN"=concept Logo im Fußbereich (Standardeinstellung)
** @@latex:\textbackslash useoutertheme\{tud\}@@
*** Paketoptionen (@@latex:\textbackslash useoutertheme\{tud\}@@)
- noheader :: Benutze Folien ohne Kopfzeile
- smallrightmargin :: Schmaler rechter Rand (verletzt CD-Richtlinie
- pagenum :: Seitenzahlen in der Fußzeile anzeigen
- section :: mit Abschnittstitel auf jeder Folie
- navbar :: mit Navigationshilfen
- noddc :: ohne DRESDEN"=concept-Logo
- ddc :: mit DRESDEN"=concept-Logo
- ddcfooter :: mit DRESDEN"=concept Logo im Fußbereich (Standardeinstellung)
*** Makros (@@latex:\textbackslash useoutertheme\{tud\}@@)
- \textbackslash einrichtung{/einrichtung/} :: Legt die
 Einrichtung/Fakultät fest
- \textbackslash fachrichtung{/Fachrichtung/} :: Legt die
 Fachrichtung fest
- \textbackslash institut{/Institut/} :: Legt das
 Institut fest
- \textbackslash professur{/Professur/} :: Legt die
 Professur fest
- \textbackslash datecity{/Datumsort/} :: Legt den Ort für den Vortrag fest
*** Register (@@latex:\textbackslash useoutertheme\{tud\}@@)
- @@latex:\textbackslash topmarginnoheader@@ :: Länge, die den Oberen Rand Seitenrand bei
 Kopflosen Folien angibt.
- @@latex:\textbackslash tudbeamerfooterplacewidth@@ :: Länge, die Breite des
     Datums/Ort/(Autor-)Blockes in der Fußzeile bestimmt
- @@latex:\textbackslash tudbeamerfooterpagenumwidth@@ :: Länge, die Platz für
     die Seitenzahl in der Fußzeilereserviert
- @@latex:\textbackslash topmarginnoheader@@ :: Länge, die Platz für den
     Kurztitel in der Fußzeile reserviert
*** Vorlagen (@@latex:\textbackslash useoutertheme\{tud\}@@)      :B_frame:
:PROPERTIES:
:BEAMER_env: frame
:BEAMER_OPT: allowframebreaks
:END:
Vorlangen werden mit 
#+LaTeX: \textbf{\textbackslash setbeamertemplate\{\emph{Kategorie}\}[\emph{Vorlage}]} 
gesetzt. Es können neue
definiert und ausgewählt werden. Weitere Informationen dazu gibt es im
„Beamer User Guide“ (\texttt{texdoc beamer}).
**** headline                                                       :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Vorlage für Seitenkopf
- tud titlepage :: Titelseitenkopf
- tud header :: normaler Folienkopf
- tud noheader :: Folienkopf für kopflose Folien

**** zweitlogo/titlepage                                            :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Vorlage für ein zweites Logo im Kopf der Titelseite
- default :: kein Zweitlogo
- ddc :: DRESDEN"=concept-Logo
- logofile :: Eine Logo-Datei wird als Parameter übergeben und mit
              @@latex:\textbackslash includegraphics@@ eingebunden und auf die
              richtige Höhe skaliert.
Beispiel: 
#+LaTeX: \textbf{\textbackslash \mbox{setbeamertemplate} \{zweitlogo/headline\}[logofile]\{fremdfirma.png\}} 
