doc/latex/tud-beamerstyle/beamer-org-mode-demo.tex
% Created 2018-02-21 Mi 22:24
% Intended LaTeX compiler: pdflatex
\documentclass[presentation,t]{beamer}
\usepackage[utf8]{luainputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
%\pdfmapfile{+tud}%
%\pdfmapfile{+tudscr}%
\usepackage{amsmath}
\usepackage{uniinput}
\usepackage{amsfonts}
\usepackage{tikz}
\usepackage[ngerman, germanb]{babel}
\usetikzlibrary{decorations.pathmorphing}
\useinnertheme{rounded}
\usetheme[section,navigation,pagenum,ddc]{tud}
%\usetheme{Boadilla}
%\usecolortheme{tud}
\institut{Institut f\"ur Algebra}%
\DeclareMathOperator\Orb{Orb}%
\title[TUD-CD mit \LaTeX\ gesetzt]{Beamer-Präsentationen mit dem CD der TU Dresden}
\AtBeginDocument{\date{22.\,6.~2016}}
\subtitle{TUD-CD mit \LaTeX\ gesetzt}
\setbeamerfont{description item}{series=\bfseries}
\setbeamertemplate{date/place in footline}[default][T. Schlemmer]
\setbeamertemplate{page number in footline}[frame][total]
\AtBeginSection[]{\begin{frame}<beamer>[allowframebreaks]\frametitle{Abschnitt}\footnotesize\tableofcontents[currentsection]\end{frame}}
\setlength{\tudbeamerfooterplacewidth}{0.3\linewidth}%
\setlength{\tudbeamerfooterpagenumwidth}{5em}%
\makeatletter
%\setlength{\tudbeamerfootertitlewidth}{\paperwidth-\beamer@leftmargin-\beamer@rightmargin
%   -\tudbeamerfooterplacewidth-\tudbeamerfooterpagenumwidth}%
\makeatother
\usetheme{default}
\author{Tobias Schlemmer}
\date{@latex:7.$\backslash$,5.\textasciitilde{}2012@}
\title{Beamer-Präsentationen mit dem CD der TU Dresden}
\hypersetup{
 pdfauthor={Tobias Schlemmer},
 pdftitle={Beamer-Präsentationen mit dem CD der TU Dresden},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.1 (Org mode 9.1.2)}, 
 pdflang={Germanb}}
\begin{document}

\maketitle
\begin{frame}[allowframebreaks]{Inhalt}
\tableofcontents
\end{frame}

\section{Einführung}
\label{sec:org142ac96}
\subsection{Allgemeines}
\label{sec:org8c714f2}
\begin{frame}[label={sec:orgfff3617}]{Geschichte}
\begin{itemize}
\item Corporate Design der TU Dresden
\item tudbeamer Klasse (mit vielen Nachteilen)
\item tud-cd-Paket
\item \alert{Konfigurierbarer Beamer-Stil}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orgfb014b2}]{CD-Vorgaben (Handbuch)}
\begin{itemize}
\item \textcolor{HKS65K100}{Ränder relativ zu Papiergrüße}
\item \textcolor{red}{Schriften in MS Punkt (inkompatible Maßeinheit)}
\item \textcolor{red}{Logoposition fehlt}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org36a98cd}]{Designkriterien}
\begin{itemize}
\item Interpretation der Vorgaben
\item Abweichend: HKS Farbschema und Univers
\item Kombinierbar mit \textbackslash useinnertheme\{rounded\}
\item Farbschema mit anderem Layout kombinierbar (partiell implementiert)
\item Alle Stile überschreibbar
\end{itemize}
\end{frame}
\subsection{Benutzung}
\label{sec:org8cda57f}
\begin{frame}[label={sec:orge7a94c5}]{Beispieldokument}
\textbackslash usepackage[ngerman]\{babel\}\\
\textbackslash usetheme[section,navigation]\{tud\}\\
\textbackslash institut\{Institut f\textbackslash ''ur Algebra\}\%\\
\textbackslash title[Beispiel]\{Langer Titel mit Beispiel\}\\
\textbackslash begin\{document\}\\
\textbackslash maketitle\\
\textbackslash begin\{frame\}\{Eine Folie\}\\
Inhalt\\
\textbackslash end\{frame\}\\
\textbackslash end\{document\}\\
\end{frame}

\section{Einstellungen}
\label{sec:org9450a1e}
\subsection{\textbackslash usetheme\{tud\}}
\label{sec:org7543d1e}
\begin{frame}[label={sec:org8492c93}]{Paketoptionen (Schriften)}
\begin{description}
\item[{noeulermath}] Benutze keine Euler-Mathematikschriften
\item[{noDIN}] Titel ohne DIN bold
\item[{serifmath}] Nutze Computer Modern für Mathematik
\item[{heavyfont}] Nutze Univers 55 statt Univers 45
\item[{beamerfont}] Keine Fontänderungen
\end{description}
\end{frame}
\begin{frame}[label={sec:org6fe4286}]{Paketoptionen (Seitenstruktur)}
\begin{description}
\item[{noheader}] Benutze Folien ohne Kopfzeile
\item[{smallrightmargin}] Schmaler rechter Rand (verletzt CD-Richtlinie
\item[{pagenum}] Seitenzahlen in der Fußzeile anzeigen
\item[{section}] mit Abschnittstitel auf jeder Folie
\item[{navbar}] mit Navigationshilfen
\item[{noddc}] ohne DRESDEN"=concept-Logo
\item[{ddc}] mit DRESDEN"=concept-Logo
\item[{ddcfooter}] mit DRESDEN"=concept Logo im Fußbereich (Standardeinstellung)
\end{description}
\end{frame}
\subsection{\textbackslash useoutertheme\{tud\}}
\label{sec:org253b1e8}
\begin{frame}[label={sec:org8f5dd1e}]{Paketoptionen (\textbackslash useoutertheme\{tud\})}
\begin{description}
\item[{noheader}] Benutze Folien ohne Kopfzeile
\item[{smallrightmargin}] Schmaler rechter Rand (verletzt CD-Richtlinie
\item[{pagenum}] Seitenzahlen in der Fußzeile anzeigen
\item[{section}] mit Abschnittstitel auf jeder Folie
\item[{navbar}] mit Navigationshilfen
\item[{noddc}] ohne DRESDEN"=concept-Logo
\item[{ddc}] mit DRESDEN"=concept-Logo
\item[{ddcfooter}] mit DRESDEN"=concept Logo im Fußbereich (Standardeinstellung)
\end{description}
\end{frame}
\begin{frame}[label={sec:orgc738b4a}]{Makros (\textbackslash useoutertheme\{tud\})}
\begin{description}
\item[{\textbackslash einrichtung\{\emph{einrichtung}\}}] Legt die
Einrichtung/Fakultät fest
\item[{\textbackslash fachrichtung\{\emph{Fachrichtung}\}}] Legt die
Fachrichtung fest
\item[{\textbackslash institut\{\emph{Institut}\}}] Legt das
Institut fest
\item[{\textbackslash professur\{\emph{Professur}\}}] Legt die
Professur fest
\item[{\textbackslash datecity\{\emph{Datumsort}\}}] Legt den Ort für den Vortrag fest
\end{description}
\end{frame}
\begin{frame}[label={sec:org3a37624}]{Register (\textbackslash useoutertheme\{tud\})}
\begin{description}
\item[{\textbackslash topmarginnoheader}] Länge, die den Oberen Rand Seitenrand bei
Kopflosen Folien angibt.
\item[{\textbackslash tudbeamerfooterplacewidth}] Länge, die Breite des
Datums/Ort/(Autor-)Blockes in der Fußzeile bestimmt
\item[{\textbackslash tudbeamerfooterpagenumwidth}] Länge, die Platz für
die Seitenzahl in der Fußzeilereserviert
\item[{\textbackslash topmarginnoheader}] Länge, die Platz für den
Kurztitel in der Fußzeile reserviert
\end{description}
\end{frame}
\begin{frame}[allowframebreaks]{Vorlagen (\textbackslash useoutertheme\{tud\})}
Vorlangen werden mit 
\textbf{\textbackslash setbeamertemplate\{\emph{Kategorie}\}[\emph{Vorlage}]}
gesetzt. Es können neue
definiert und ausgewählt werden. Weitere Informationen dazu gibt es im
„Beamer User Guide“ (\texttt{texdoc beamer}).
\begin{block}{headline}
Vorlage für Seitenkopf
\begin{description}
\item[{tud titlepage}] Titelseitenkopf
\item[{tud header}] normaler Folienkopf
\item[{tud noheader}] Folienkopf für kopflose Folien
\end{description}
\end{block}

\begin{block}{zweitlogo/titlepage}
Vorlage für ein zweites Logo im Kopf der Titelseite
\begin{description}
\item[{default}] kein Zweitlogo
\item[{ddc}] DRESDEN"=concept-Logo
\item[{logofile}] Eine Logo-Datei wird als Parameter übergeben und mit
\textbackslash includegraphics eingebunden und auf die
richtige Höhe skaliert.
\end{description}
Beispiel: 
\textbf{\textbackslash \mbox{setbeamertemplate} \{zweitlogo/headline\}[logofile]\{fremdfirma.png\}}
\end{block}
