doc/latex/tud-beamerstyle/beamer-org-mode-demo.org
**** zweitlogo/titlepage (Fortsetzung)                           :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
- freeform :: Es wird der \LaTeX -Code direkt als Parameter übergeben. Beispiel:
              #+LaTeX: \textbf{\textbackslash \mbox{setbeamertemplate} \{zweitlogo/headline\}[freeform]\{\textbackslash LaTeX\}} 
              In diesem Fall ist die Höhe des Logos im Makro
              @@latex:\texttt{\textbackslash logoheight}@@ hinterlegt. Für die
              Weiterverarbeitung ist wichtig, dass es in ein
              skaliertes Register expandiert wird (siehe
              @@latex:\texttt{beamerouterthemetod.sty}@@).

**** zweitlogo/headline                                             :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Vorlage für ein zweites Logo im Kopf einer normalen Seite (keine Titelseite)
- default :: kein Zweitlogo
- ddc :: DRESDEN"=concept-Logo
- logofile :: Eine Logo-Datei wird als Parameter übergeben und mit
              @@latex:\textbackslash includegraphics@@ eingebunden und auf die
              richtige Höhe skaliert.
Beispiel: 
#+LaTeX: \textbf{\textbackslash setbeamertemplate\{zweitlogo/headline\}[logofile]\{fremdfirma.png\}} 
**** zweitlogo/headline (Fortsetzung)                            :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
- freeform :: Es wird der \LaTeX -Code direkt als Parameter übergeben. Beispiel:
              #+LaTeX: \textbf{\textbackslash setbeamertemplate\{zweitlogo/headline\}[freeform]\{\textbackslash LaTeX\}} 
              In diesem Fall ist die Höhe des Logos im Makro
              @@latex:\texttt{\textbackslash logoheight}@@ hinterlegt. Für die
              Weiterverarbeitung ist wichtig, dass es in ein
              skaliertes Register expandiert wird (siehe
              @@latex:\texttt{beamerouterthemetod.sty}@@).

**** date/place in footline                                      :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:

- default :: Vorlage für Datum/Ort in Fußzeile mit optionalem Argument
 für Ort. Standardwert „TU Dresden“.

**** short title in footline                                     :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:

- default :: Fügt den Kurztitel in die Fußzeile ein

**** page number in footline                                     :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
\small
- page :: Setzt die Seitenzahl. Die Form kann als optionaler Parameter
 übergeben werden. Standardwert „text and total". Für weitere Werte
 siehe unten, Vorlagen, die mit „page number: “ anfangen (dieser Teil
 wird automatisch hinzugefügt).
- frame :: Setzt die Foliennummer. Die Form kann als optionaler Parameter
 übergeben werden. Standardwert „text and total". Für weitere Werte
 siehe unten, Vorlagen, die mit „frame number: “ anfangen (dieser Teil
 wird automatisch hinzugefügt).

**** page number: text and total                                 :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt Seitenzahl – Sprachauswahl für Nummer und Gesamtzahl.(wird automatisch gesetzt)
- english :: Englisch
- german :: Deutsch

**** page number: text                                 :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt Seitenzahl – Sprachauswahl für Nummer.(wird automatisch gesetzt)
- english :: Englisch
- german :: Deutsch

**** page number: total                                             :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt Seitenzahl und Gesamtzahl ohne Worte.(wird automatisch gesetzt)
- default :: Standardeinstellung

**** page number: only                                              :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt Seitenzahl ohne Gesamtzahl ohne Worte.(wird automatisch gesetzt)
- default :: Standardeinstellung

**** frame number: text and total                                   :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt Foliennummer – Sprachauswahl für Nummer und Gesamtzahl.(wird automatisch gesetzt)
- english :: Englisch
- german :: Deutsch

**** frame number: text                                   :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt Foliennummer – Sprachauswahl für Nummer.(wird automatisch gesetzt)
- english :: Englisch
- german :: Deutsch

**** frame number: total                                            :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt Foliennummer und Gesamtzahl ohne Worte.(wird automatisch gesetzt)
- default :: Standardeinstellung

**** frame number: only                                             :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt Foliennummer ohne  Gesamtzahl ohne Worte.(wird automatisch gesetzt)
- default :: Standardeinstellung


**** footline                                                       :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt den Seitenfuß

- tud titlepage :: Fußzeile auf der Titelseite
- tud pagenum :: Fußzeile mit Seiten- oder Folienzahl entsprechend dem
   Parameter zu „page number in footline“
- tud nopagenum :: Fußzeile ohne Seiten- und Folienzahl

**** frametitle                                                  :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt den Folientitel
- tud titlesection :: Setzt vor dem eigentlichen Titel den
Abschnittstitel
- tud notitlesection :: Es wird nur der 

**** einrichtung/titlepage                                          :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt die Einrichtung im Seitenkopf auf der Titelseite

- default :: normal
- empty :: keine Ausgabe
**** fachrichtung/titlepage                                         :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt die Fachrichtung im Seitenkopf auf der Titelseite

- default :: normal
- empty :: keine Ausgabe
**** intstitut/titlepage                                            :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt den Institutsnamen im Seitenkopf auf der Titelseite

- default :: normal
- empty :: keine Ausgabe

**** professur/titlepage                                            :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Setzt die Professur im Seitenkopf auf der Titelseite

- default :: normal
- empty :: keine Ausgabe

*** Beispiel (@@latex:\textbackslash useoutertheme\{tud\}@@)

\textbackslash setbeamercolor{normal text}{bg=white}\\
\textbackslash setbeamertemplate{headline}[tud header]\\
\textbackslash setbeamertemplate{footline}[tud pagenum]\\
\textbackslash setbeamertemplate{frametitle}[tud notitlesection]\\
 

** @@latex:\textbackslash usefonttheme\{tud\}@@

*** Paketoptionen (@@latex:\textbackslash usefonttheme\{tud\}@@)
- noeulermath :: Benutze keine Euler-Mathematikschriften
- noDIN :: Titel ohne DIN bold
- nodin :: Titel ohne DIN bold
- serifmath :: Nutze Computer Modern für Mathematik
- heavyfont :: Nutze Univers 55 statt Univers 45
- beamerfont :: Keine Fontänderungen

*** Makros (@@latex:\textbackslash usefonttheme\{tud\}@@)
- @@latex:\textbackslash tudtitlenormalsize@@ :: Ersatz für @@latex:\textbackslash
  normalsize@@ auf der Titelseite
- @@latex:\textbackslash tudtitlesmall@@ :: Ersatz für @@latex:\textbackslash small@@ auf der Titelseite
- @@latex:\textbackslash tudtitletiny@@ :: Ersatz für @@latex:\textbackslash tiny@@ auf der Titelseite

Darüberhinaus lädt dieses Paket das Paket „tudfonts“ mit all seinen makros

