doc/latex/tud-beamerstyle/beamer-org-mode-demo.tex
\begin{block}{zweitlogo/titlepage (Fortsetzung)}
\begin{description}
\item[{freeform}] Es wird der \LaTeX -Code direkt als Parameter übergeben. Beispiel:
\textbf{\textbackslash \mbox{setbeamertemplate} \{zweitlogo/headline\}[freeform]\{\textbackslash LaTeX\}}
In diesem Fall ist die Höhe des Logos im Makro
\texttt{\textbackslash logoheight} hinterlegt. Für die
Weiterverarbeitung ist wichtig, dass es in ein
skaliertes Register expandiert wird (siehe
\texttt{beamerouterthemetod.sty}).
\end{description}
\end{block}

\begin{block}{zweitlogo/headline}
Vorlage für ein zweites Logo im Kopf einer normalen Seite (keine Titelseite)
\begin{description}
\item[{default}] kein Zweitlogo
\item[{ddc}] DRESDEN"=concept-Logo
\item[{logofile}] Eine Logo-Datei wird als Parameter übergeben und mit
\textbackslash includegraphics eingebunden und auf die
richtige Höhe skaliert.
\end{description}
Beispiel: 
\textbf{\textbackslash setbeamertemplate\{zweitlogo/headline\}[logofile]\{fremdfirma.png\}}
\end{block}
\begin{block}{zweitlogo/headline (Fortsetzung)}
\begin{description}
\item[{freeform}] Es wird der \LaTeX -Code direkt als Parameter übergeben. Beispiel:
\textbf{\textbackslash setbeamertemplate\{zweitlogo/headline\}[freeform]\{\textbackslash LaTeX\}}
In diesem Fall ist die Höhe des Logos im Makro
\texttt{\textbackslash logoheight} hinterlegt. Für die
Weiterverarbeitung ist wichtig, dass es in ein
skaliertes Register expandiert wird (siehe
\texttt{beamerouterthemetod.sty}).
\end{description}
\end{block}

\begin{block}{date/place in footline}
\begin{description}
\item[{default}] Vorlage für Datum/Ort in Fußzeile mit optionalem Argument
für Ort. Standardwert „TU Dresden“.
\end{description}
\end{block}

\begin{block}{short title in footline}
\begin{description}
\item[{default}] Fügt den Kurztitel in die Fußzeile ein
\end{description}
\end{block}

\begin{block}{page number in footline}
\small
\begin{description}
\item[{page}] Setzt die Seitenzahl. Die Form kann als optionaler Parameter
übergeben werden. Standardwert „text and total". Für weitere Werte
siehe unten, Vorlagen, die mit „page number: “ anfangen (dieser Teil
wird automatisch hinzugefügt).
\item[{frame}] Setzt die Foliennummer. Die Form kann als optionaler Parameter
übergeben werden. Standardwert „text and total". Für weitere Werte
siehe unten, Vorlagen, die mit „frame number: “ anfangen (dieser Teil
wird automatisch hinzugefügt).
\end{description}
\end{block}

\begin{block}{page number: text and total}
Setzt Seitenzahl – Sprachauswahl für Nummer und Gesamtzahl.(wird automatisch gesetzt)
\begin{description}
\item[{english}] Englisch
\item[{german}] Deutsch
\end{description}
\end{block}

\begin{block}{page number: text}
Setzt Seitenzahl – Sprachauswahl für Nummer.(wird automatisch gesetzt)
\begin{description}
\item[{english}] Englisch
\item[{german}] Deutsch
\end{description}
\end{block}

\begin{block}{page number: total}
Setzt Seitenzahl und Gesamtzahl ohne Worte.(wird automatisch gesetzt)
\begin{description}
\item[{default}] Standardeinstellung
\end{description}
\end{block}

\begin{block}{page number: only}
Setzt Seitenzahl ohne Gesamtzahl ohne Worte.(wird automatisch gesetzt)
\begin{description}
\item[{default}] Standardeinstellung
\end{description}
\end{block}

\begin{block}{frame number: text and total}
Setzt Foliennummer – Sprachauswahl für Nummer und Gesamtzahl.(wird automatisch gesetzt)
\begin{description}
\item[{english}] Englisch
\item[{german}] Deutsch
\end{description}
\end{block}

\begin{block}{frame number: text}
Setzt Foliennummer – Sprachauswahl für Nummer.(wird automatisch gesetzt)
\begin{description}
\item[{english}] Englisch
\item[{german}] Deutsch
\end{description}
\end{block}

\begin{block}{frame number: total}
Setzt Foliennummer und Gesamtzahl ohne Worte.(wird automatisch gesetzt)
\begin{description}
\item[{default}] Standardeinstellung
\end{description}
\end{block}

\begin{block}{frame number: only}
Setzt Foliennummer ohne  Gesamtzahl ohne Worte.(wird automatisch gesetzt)
\begin{description}
\item[{default}] Standardeinstellung
\end{description}
\end{block}


\begin{block}{footline}
Setzt den Seitenfuß

\begin{description}
\item[{tud titlepage}] Fußzeile auf der Titelseite
\item[{tud pagenum}] Fußzeile mit Seiten- oder Folienzahl entsprechend dem
Parameter zu „page number in footline“
\item[{tud nopagenum}] Fußzeile ohne Seiten- und Folienzahl
\end{description}
\end{block}

\begin{block}{frametitle}
Setzt den Folientitel
\begin{description}
\item[{tud titlesection}] Setzt vor dem eigentlichen Titel den
\end{description}
Abschnittstitel
\begin{description}
\item[{tud notitlesection}] Es wird nur der
\end{description}
\end{block}

\begin{block}{einrichtung/titlepage}
Setzt die Einrichtung im Seitenkopf auf der Titelseite

\begin{description}
\item[{default}] normal
\item[{empty}] keine Ausgabe
\end{description}
\end{block}
\begin{block}{fachrichtung/titlepage}
Setzt die Fachrichtung im Seitenkopf auf der Titelseite

\begin{description}
\item[{default}] normal
\item[{empty}] keine Ausgabe
\end{description}
\end{block}
\begin{block}{intstitut/titlepage}
Setzt den Institutsnamen im Seitenkopf auf der Titelseite

\begin{description}
\item[{default}] normal
\item[{empty}] keine Ausgabe
\end{description}
\end{block}

\begin{block}{professur/titlepage}
Setzt die Professur im Seitenkopf auf der Titelseite

\begin{description}
\item[{default}] normal
\item[{empty}] keine Ausgabe
\end{description}
\end{block}
\end{frame}

\begin{frame}[label={sec:orga958255}]{Beispiel (\textbackslash useoutertheme\{tud\})}
\textbackslash setbeamercolor\{normal text\}\{bg=white\}\\
\textbackslash setbeamertemplate\{headline\}[tud header]\\
\textbackslash setbeamertemplate\{footline\}[tud pagenum]\\
\textbackslash setbeamertemplate\{frametitle\}[tud notitlesection]\\
\end{frame}


\subsection{\textbackslash usefonttheme\{tud\}}
\label{sec:org948f5ed}

\begin{frame}[label={sec:orgf1f9510}]{Paketoptionen (\textbackslash usefonttheme\{tud\})}
\begin{description}
\item[{noeulermath}] Benutze keine Euler-Mathematikschriften
\item[{noDIN}] Titel ohne DIN bold
\item[{nodin}] Titel ohne DIN bold
\item[{serifmath}] Nutze Computer Modern für Mathematik
\item[{heavyfont}] Nutze Univers 55 statt Univers 45
\item[{beamerfont}] Keine Fontänderungen
\end{description}
\end{frame}

\begin{frame}[label={sec:org2925a5f}]{Makros (\textbackslash usefonttheme\{tud\})}
\begin{description}
\item[{\textbackslash tudtitlenormalsize}] Ersatz für \textbackslash
  normalsize auf der Titelseite
\item[{\textbackslash tudtitlesmall}] Ersatz für \textbackslash small auf der Titelseite
\item[{\textbackslash tudtitletiny}] Ersatz für \textbackslash tiny auf der Titelseite
\end{description}

Darüberhinaus lädt dieses Paket das Paket „tudfonts“ mit all seinen makros
\end{frame}
