doc/latex/tud-beamerstyle/beamer-org-mode-demo.org
*** Schriftvorlagen (@@latex:\textbackslash usefonttheme\{tud\}@@) :B_frame:
:PROPERTIES:
:BEAMER_env: frame
:BEAMER_OPT: allowframebreaks
:END:
Vorlangen werden mit \textbackslash
setbeamerfont{/Name/}{Werte} gesetzt. Sie können mit @@latex:\textbackslash
usebeamerfont@@ aktiviert werden. Weitere Informationen dazu gibt es im
„Beamer User Guide“ (@@latex:\texttt{texdoc beamer}@@).

Es werden folgende Vorlagen definiert:
-  @@latex:\textbackslash setbeamerfont\{itemize/enumerate subbody\} \{size=\textbackslash scriptsize\}@@
-  @@latex:\textbackslash setbeamerfont\{itemize/enumerate subsubbody\} \{size=\textbackslash scriptsize\}@@
-  @@latex:\textbackslash setbeamerfont\{section in head/foot\}\{size=\textbackslash normalsize, family=\textbackslash sffamily\}@@
-  @@latex:\textbackslash setbeamerfont\{frametitle\} \{size=\textbackslash normalsize, family=\textbackslash sffamily\}@@
-  @@latex:\textbackslash setbeamerfont\{framesubtitle\} \{size=\textbackslash
   small, series=\textbackslash bfseries,family=\textbackslash sffamily\}@@
-  @@latex:\textbackslash setbeamerfont\{footline\} \{size=\textbackslash tiny\}@@
-  @@latex:\textbackslash setbeamerfont\{block title\} \{size=\{\}\}@@
-  @@latex:\textbackslash if@noDIN
    \textbackslash setbeamerfont\{title\} \{size=\textbackslash
   @setfontsize\textbackslash LARGE\textbackslash @xviipt\{22\},
   series=\textbackslash bfseries, family=\textbackslash sffamily\}
  \textbackslash else
    \textbackslash setbeamerfont\{title\} \{size=\textbackslash
   @setfontsize\textbackslash LARGE\textbackslash @xviipt\{22\},
   series=\textbackslash bfseries, family=\textbackslash dinfamily\}
  \textbackslash fi@@
-  @@latex:\textbackslash setbeamerfont\{subtitle\} \{series=\textbackslash
   bfseries, family=\textbackslash sffamily\}@@
-  @@latex:\textbackslash setbeamerfont\{einrichtung/titlepage\}
   \{size=\textbackslash tudtitletiny, series=\textbackslash bfseries\}@@
-  @@latex:\textbackslash setbeamerfont\{fachrichtung/titlepage\} \{size=\textbackslash tudtitletiny\}@@
-  @@latex:\textbackslash setbeamerfont\{institut/titlepage\} \{parent=fachrichtung/titlepage\}@@
-  @@latex:\textbackslash setbeamerfont\{professur/titlepage\} \{parent=fachrichtung/titlepage\}@@
-  @@latex:\textbackslash setbeamerfont\{date in head/foot/titlepage\} \{size=\textbackslash tudtitlenormalsize\}@@
-  @@latex:\textbackslash setbeamerfont\{author\} \{size=\textbackslash tudtitlesmall\}@@



** @@latex:\textbackslash usecolortheme\{tud\}@@

*** Makros (@@latex:\textbackslash usecolortheme\{tud\}@@)
- @@latex:\textbackslash darktitlepage@@ :: Stellt eine dunkle Titelseite ein, wie
vom CD gefordert
- @@latex:\textbackslash whitetitlepage@@ :: Titelseite wird weiß (nicht CD-Konform).

Darüberhinaus lädt dieses Paket das Paket „tudcolors“ mit all seinen
makros und den HKS-Farben (siehe Dokumentation von tudmathposter)

