doc/latex/tud-beamerstyle/beamer-org-mode-demo.tex

\begin{frame}[allowframebreaks]{Schriftvorlagen (\textbackslash usefonttheme\{tud\})}
Vorlangen werden mit \textbackslash
setbeamerfont\{\emph{Name}\}\{Werte\} gesetzt. Sie können mit \textbackslash
usebeamerfont aktiviert werden. Weitere Informationen dazu gibt es im
„Beamer User Guide“ (\texttt{texdoc beamer}).

Es werden folgende Vorlagen definiert:
\begin{itemize}
\item \textbackslash setbeamerfont\{itemize/enumerate subbody\} \{size=\textbackslash scriptsize\}
\item \textbackslash setbeamerfont\{itemize/enumerate subsubbody\} \{size=\textbackslash scriptsize\}
\item \textbackslash setbeamerfont\{section in head/foot\}\{size=\textbackslash normalsize, family=\textbackslash sffamily\}
\item \textbackslash setbeamerfont\{frametitle\} \{size=\textbackslash normalsize, family=\textbackslash sffamily\}
\item \textbackslash setbeamerfont\{framesubtitle\} \{size=\textbackslash
   small, series=\textbackslash bfseries,family=\textbackslash sffamily\}
\item \textbackslash setbeamerfont\{footline\} \{size=\textbackslash tiny\}
\item \textbackslash setbeamerfont\{block title\} \{size=\{\}\}
\item \textbackslash if@noDIN
    \textbackslash setbeamerfont\{title\} \{size=\textbackslash
   @setfontsize\textbackslash LARGE\textbackslash @xviipt\{22\},
   series=\textbackslash bfseries, family=\textbackslash sffamily\}
  \textbackslash else
    \textbackslash setbeamerfont\{title\} \{size=\textbackslash
   @setfontsize\textbackslash LARGE\textbackslash @xviipt\{22\},
   series=\textbackslash bfseries, family=\textbackslash dinfamily\}
  \textbackslash fi
\item \textbackslash setbeamerfont\{subtitle\} \{series=\textbackslash
   bfseries, family=\textbackslash sffamily\}
\item \textbackslash setbeamerfont\{einrichtung/titlepage\}
   \{size=\textbackslash tudtitletiny, series=\textbackslash bfseries\}
\item \textbackslash setbeamerfont\{fachrichtung/titlepage\} \{size=\textbackslash tudtitletiny\}
\item \textbackslash setbeamerfont\{institut/titlepage\} \{parent=fachrichtung/titlepage\}
\item \textbackslash setbeamerfont\{professur/titlepage\} \{parent=fachrichtung/titlepage\}
\item \textbackslash setbeamerfont\{date in head/foot/titlepage\} \{size=\textbackslash tudtitlenormalsize\}
\item \textbackslash setbeamerfont\{author\} \{size=\textbackslash tudtitlesmall\}
\end{itemize}
\end{frame}



\subsection{\textbackslash usecolortheme\{tud\}}
\label{sec:orge42ca70}

\begin{frame}[label={sec:org5ad9746}]{Makros (\textbackslash usecolortheme\{tud\})}
\begin{description}
\item[{\textbackslash darktitlepage}] Stellt eine dunkle Titelseite ein, wie
\end{description}
vom CD gefordert
\begin{description}
\item[{\textbackslash whitetitlepage}] Titelseite wird weiß (nicht CD-Konform).
\end{description}

Darüberhinaus lädt dieses Paket das Paket „tudcolors“ mit all seinen
makros und den HKS-Farben (siehe Dokumentation von tudmathposter)
\end{frame}
