doc/latex/tud-beamerstyle/beamer-org-mode-demo.org
*** Farbvorlagen (@@latex:\textbackslash usecolortheme\{tud\}@@)  :B_frame:
:PROPERTIES:
:BEAMER_env: frame
:BEAMER_OPT: allowframebreaks
:END:
Farbvorlagen werden mit \textbackslash
setbeamercolor{/Name/}{Werte} gesetzt. Sie können mit @@latex:\textbackslash
usebeamercolor@@ für die Aktivierung geladen werden. Weitere Informationen dazu gibt es im
„Beamer User Guide“ (@@latex:\texttt{texdoc beamer}@@).

Es werden folgende Vorlagen definiert:
-  @@latex:\textbackslash setbeamercolor\{normal text\} \{fg=HKS41K100,bg=white\}@@
-  @@latex:\textbackslash setbeamercolor\{structure\} \{fg=HKS41K100\}@@
-  @@latex:\textbackslash setbeamercolor\{alerted text\} \{fg=HKS44K100\}@@
-  @@latex:\textbackslash setbeamercolor\{alternate palette\} \{fg=HKS92K80\}@@
-  @@latex:\textbackslash setbeamercolor\{date in head/foot\} \{parent=alternate palette\}@@
-  @@latex:\textbackslash setbeamercolor\{title in head/foot\} \{parent=alternate palette\}@@
-  @@latex:\textbackslash setbeamercolor\{page number in head/foot\} \{parent=alternate palette\}@@
-  @@latex:\textbackslash setbeamercolor\{section in head/foot\} \{parent=alternate palette\}@@
-  @@latex:\textbackslash setbeamercolor\{subsection in head/foot\} \{parent=section in head/foot\}@@
-  @@latex:\textbackslash setbeamercolor\{upper separation line head\} \{parent=alternate palette\}@@
-  @@latex:\textbackslash setbeamercolor\{lower separation line head\} \{parent=upper separation line head\}@@
-  @@latex:\textbackslash setbeamercolor\{author in head/foot\} \{parent=section in head/foot\}@@
-  @@latex:\textbackslash setbeamercolor\{title in head/foot\} \{parent=subsection in head/foot\}@@
-  @@latex:\textbackslash setbeamercolor\{logo\} \{use=structure, fg=structure.fg\}@@
-  @@latex:\textbackslash newcommand*\{\textbackslash darktitlepage\}\{@@%
  -  @@latex:\textbackslash setbeamercolor\{normal text/titlepage\} \{fg=white,bg=HKS41K100\}%@@
  -  @@latex:\textbackslash setbeamercolor\{title\} \{use=normal text/titlepage, fg=normal text/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{subtitle\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{author/titlepage\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{headline/titlepage\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{logo/titlepage\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{einrichtung/titlepage\}
     \{use=normal text/titlepage, fg=normal text/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{fachrichtung/titlepage\}
     \{use=einrichtung/titlepage, fg=einrichtung/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{institut/titlepage\}
     \{use=einrichtung/titlepage, fg=einrichtung/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{professur/titlepage\}
     \{use=einrichtung/titlepage, fg=einrichtung/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{upper separation line
     head/titlepage\} \{use=normal text/titlepage, fg=normal text/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{lower separation line head/titlepage\}%
      \{use=upper separation line head/titlepage, fg=upper separation line head/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{date in head/foot/titlepage\}
     \{use=normal text/titlepage, fg=normal text/titlepage.fg\}%@@
  -  @@latex:\textbackslash let\textbackslash logo\@ DDC\textbackslash logo\@ DDC\@ white@@
  -  @@latex:\textbackslash let\textbackslash logo\@ DDCf\textbackslash logo\@ DDC\@ whitef
     \}@@
-  @@latex:\textbackslash newcommand*\{\textbackslash whitetitlepage\}\{%@@
  -   @@latex:\textbackslash setbeamercolor\{normal text/titlepage\}@@
      \{use=normal text,fg=normal text.fg, bg=normal text.bg\}@@
  - @@latex:\textbackslash setbeamercolor\{title\} \{use=normal
    text/titlepage, fg=normal text/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{subtitle\} \{use=normal
     text/titlepagexo, fg=normal text/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{author/titlepage\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{headline/titlepage\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{logo/titlepage\} \{use=normal
     text/titlepage, fg=normal text/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{einrichtung/titlepage\} \{fg=HKS92K100\}%@@
  -  @@latex:\textbackslash setbeamercolor\{fachrichtung/titlepage\}
     \{use=einrichtung/titlepage, fg=einrichtung/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{institut/titlepage\}
     \{use=einrichtung/titlepage, fg=einrichtung/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{professur/titlepage\}
     \{use=einrichtung/titlepage, fg=einrichtung/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{upper separation line
     head/titlepage\} \{fg=HKS92K100\}%@@
  -  @@latex:\textbackslash setbeamercolor\{lower separation line head/titlepage\}%
      \{use=upper separation line head/titlepage,fg=upper separation line
        head/titlepage.fg\}%@@
  -  @@latex:\textbackslash setbeamercolor\{date in head/foot/titlepage\} \{fg=HKS92K100\}%@@
  -  @@latex:\textbackslash let\textbackslash logo\@ DDC\textbackslash logo\@ DDC\@ bunt%@@
  -  @@latex:\textbackslash let\textbackslash logo\@ DDCf\textbackslash logo\@ DDC\@ colorf
     \}@@
-  @@latex:\textbackslash darktitlepage@@
  
-  @@latex:\textbackslash setbeamercolor\{block body\} \{use=normal text,
   fg=normal text.fg, bg=HKS41K10\}@@
-  @@latex:\textbackslash setbeamercolor\{block title\} \{fg=HKS41K100,bg=HKS41K20\}@@
-  @@latex:\textbackslash setbeamercolor\{block body example\} \{use=normal
   text, fg=normal text.fg, bg=HKS41K10\}@@
-  @@latex:\textbackslash setbeamercolor\{block title example\}
   \{fg=HKS57K100, bg=HKS41K20\}@@
-  @@latex:\textbackslash setbeamercolor\{block body alerted\} \{use=normal
   text, fg=normal text.fg, bg=HKS65K10\}@@
-  @@latex:\textbackslash setbeamercolor\{block title alerted\}
   \{fg=HKS07K100, bg=HKS65K20\}@@



** @@latex:\textbackslash useinnertheme\{tud\}@@

*** Vorlagen (@@latex:\textbackslash useinnertheme\{tud\}@@)      :B_frame:
:PROPERTIES:
:BEAMER_env: frame
:BEAMER_OPT: allowframebreaks
:END:
Für die inneren Vorlagen gibt es keine Vorgaben außer für die
Titelseite.
**** Verwendete Vorlagen/Makros                                  :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
- @@latex:\textbackslash beamertemplatedotitem@@ :: siehe beamer-Dokumentation
- @@latex:\textbackslash usesubitemizeitemtemplate\{-\/-\}@@ :: siehe
     beamer-Dokumentation
- @@latex:\textbackslash setbeamertemplate\{title page\}[tud]@@ :: stellt das CD
     der TUD für die Titelseite ein. Dieses Makro wird automatisch mit
     @@latex:\textbackslash begin \{document\}@@ aufgerufen.

* Tips und Tricks
** Tips
*** Fußzeile
Die Fußzeile sollte die wichtigsten Informationen enthalten, an die
sich das Publikum erinnern soll. Wenn das TU-Logo im Kopf enthalten
ist die Angabe „TU Dresden“ redundant.

@@latex:\textbackslash setbeamertemplate\{date/place in
footline\}[default][I. Nachname]@@

Setzt statt der TU Dresden den Namen
des Sprechers.
*** Blöcke mit runden Ecken und Schatten
**** Aufruf                                                      :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
Blöcke wie dieser hier werden mittels 

@@latex:\textbackslash useinnertheme[shadow=true]\{rounded\}@@

in der Dokumentpräambel voreingestellt
** Ein Beispiel    
*** Eine Beispielfolie                                              
**** 0.3                                                       :B_columns:
:PROPERTIES:
:BEAMER_env: columns
:END:
