doc/latex/tud-beamerstyle/beamer-org-mode-demo.tex
\tikzstyle{automorphismuspfeil}=[->,HKS44K100,decoration={bent,aspect=0.3,amplitude=3},decorate]
\tikzstyle{automorphismuspfeil2}=[automorphismuspfeil,decoration={bent,aspect=0.3,amplitude=2}]
\begin{tikzpicture}
\draw (0,0) node (n0) {0};
\draw (-1,1) node (n1) {1};
\draw (1,1) node (n2) {2};
\draw (-1.5,2) node (n3) {3};
\draw (-0.5,2) node (n4) {4};
\draw (0.5,2) node (n5) {5};
\draw (1.5,2) node (n6) {6};
\draw (0,3) node (n7) {7};
\draw (n0) -- (n1) -- (n3) -- (n7) -- (n6) -- (n2) -- (n0);
\draw (n1) -- (n4) -- (n7) -- (n5) -- (n2);
\only<1,2,5,6> {
  \draw[automorphismuspfeil] (n1) -- (n2);
  \draw[automorphismuspfeil] (n2) -- (n1); 
}
\only<3,4>{
  \draw[automorphismuspfeil] (n3) -- (n4);
  \draw[automorphismuspfeil] (n4) -- (n3);
}
\only<5>{
  \draw[automorphismuspfeil] (n3) -- (n5);
  \draw[automorphismuspfeil] (n5) -- (n3);
}
\only<6>{
  \draw[automorphismuspfeil] (n3) -- (n6);
  \draw[automorphismuspfeil] (n6) -- (n3);
}
\only<6>{
  \draw[automorphismuspfeil2] (n4) -- (n5);
  \draw[automorphismuspfeil2] (n5) -- (n4);
}
\only<5>{
  \draw[automorphismuspfeil] (n4) -- (n6);
  \draw[automorphismuspfeil] (n6) -- (n4);
}
\only<3,4>{
  \draw[automorphismuspfeil] (n5) -- (n6);
  \draw[automorphismuspfeil] (n6) -- (n5);
}
\only<1>{
  \draw[automorphismuspfeil] (n3) -- (n5);
  \draw[automorphismuspfeil2] (n5) -- (n4);
  \draw[automorphismuspfeil] (n4) -- (n6);
  \draw[automorphismuspfeil] (n6) -- (n3);
}
\only<2>{
  \draw[automorphismuspfeil] (n3) -- (n6);
  \draw[automorphismuspfeil] (n6) -- (n4);
  \draw[automorphismuspfeil2] (n4) -- (n5);
  \draw[automorphismuspfeil] (n5) -- (n3);
}
\end{tikzpicture}
\end{column}
\begin{column}{0.7\columnwidth}
\begin{block}{Beschreibung}
Eine Tabelle

{}\uncover<2->{\tiny %}
\begin{center}
\begin{tabular}{lllllllll}
\hline
 & \(1\) & \(a\) & \(b\) & \(c\) & \(d\) & \(e\) & \(f\) & \(g\)\\
\hline
\(1=(1)\) & \(1\) & \(a\) & \(b\) & \(c\) & \(d\) & \(e\) & \(f\) & \(g\)\\
\(a=(34)\) & \(a\) & \(1\) & \(c\) & \(b\) & \(g\) & \(f\) & \(e\) & \(d\)\\
\(b=(56)\) & \(b\) & \(c\) & \(1\) & \(a\) & \(f\) & \(g\) & \(d\) & \(e\)\\
\(c=(34)(56)\) & \(c\) & \(b\) & \(a\) & \(1\) & \(e\) & \(d\) & \(g\) & \(f\)\\
\(d=(12)(35)(46)\) & \(d\) & \(f\) & \(g\) & \(e\) & \(1\) & \(c\) & \(a\) & \(b\)\\
\(e=(12)(36)(45)\) & \(e\) & \(g\) & \(f\) & \(d\) & \(c\) & \(1\) & \(b\) & \(a\)\\
\(f=(12)(3546)\) & \(f\) & \(d\) & \(e\) & \(g\) & \(b\) & \(a\) & \(c\) & \(1\)\\
\(g=(12)(3645)\) & \(g\) & \(e\) & \(d\) & \(f\) & \(a\) & \(b\) & \(1\) & \(c\)\\
\hline
\end{tabular}
\end{center}
}
\end{block}
\end{column}
\end{columns}
\end{frame}


\section{Minimal agierende Automorphismen}
\label{sec:orgb9357fa}
\subsection{Quasiordnung der Automorphismen}
\label{sec:orgead3172}
\begin{frame}[label={sec:org76bab90}]{Ein Satz mit Beweis}
\begin{theorem}[Quasiordnung]
Sei \(G\leq \mathfrak{Aut}(M,\leq)\) eine Untergruppe der geordneten
Menge \((M,\leq)\). Dann ist die Relation \({\sqsubseteq}\subseteq
G\times G\) mit 
\[
g\sqsubseteq h :\Leftrightarrow ∀u∈\Orb(〈g〉)∃U'∈\Orb(〈h〉)\text{ und }U\subseteq U'
\]
eine Quasiordnung.
\end{theorem}

\begin{proof}[Beweis]
\begin{enumerate}
\item Reflexiv: \(\Orb(〈g〉) = \Orb(〈g〉)\)
\item Transitiv:
\end{enumerate}
\dots
\end{proof}
\end{frame}
\begin{frame}[label={sec:org0b7204d}]{Beispielfolie}
\begin{example}[Beispieltitel]
mal sehen, was wird
\end{example}
\begin{alertblock}{Block hervorgehoben}
Inhalt
\end{alertblock}
\end{frame}
\end{document}